{"index":{"_index":"submissions","_type":"201701182236"}}
{"id":7199,"state":"submitted","confirmed":false,"created_at":"2016-12-16T07:21:16.610Z","updated_at":"2016-12-16T07:21:16.610Z","additional_info":"https://www.youtube.com/watch?v=2e1R8f0BRKw","rating":37.75,"trust":100,"tag_list":[],"profile":{"name":"Bart Blommaerts","bio":"Bart Blommaerts is a passionate Software Architect at Ordina, who believes closing the model-code gap is essential to make rapid, agile delivery sustainable. Bart has a strong focus on API design, reuse, automation and security. He is always looking for technical challenges. Bart also is the chairman of the different JWorks Competence Leads at Ordina.\r\n\r\nBefore Ordina, Bart led the EMEA Java Community at HP and was chairman of the HP Java Governance Board in the Benelux.","twitter":"DaggieBe","company":"Ordina","url":"http://www.daggie.be","shirt_size":"Men's L","email":"daggieken@hotmail.com","location":"Belgium"},"talk":{"title":"10 tips to become an awesome Technical Lead","description":"As you grow in your career, chances are that one day you will end up as the Technical Lead of 1 or more projects. Often not by choice. The role of Technical Lead is quite different from the role of (senior) Software Developer and this talk will bring you answers on questions like:\r\n\r\n* How do I do technical interviews?\r\n* How do I lead a team? How do I lead multiple teams?\r\n* How do I cope with my new responsibilities?\r\n* How do I cope with success / failure?\r\n* How do I prevent losing focus on the technical challenges?\r\n* ...\r\n\r\nIn summary, everything you want(ed) to know on your first day as a Technical Lead and that you can use every day from that point onwards.","notes":"I've been a Technical Lead for over 10 years .. a role I never requested. I worked with small teams (2 people) and with larger teams (20+ people) as a Technical Lead. And a couple of times, I needed to do some firefighting on other projects, because of the missing experience of the Technical Lead (eg. when leading a team of offshore developers).\r\n\r\nI started a Technical Lead training program when I was back at HP to overcome issues senior developers are likely to face when becoming a Technical Lead (eg. how to do technical interviews .. Which questions are useful? Should you focus on the resume? etc. ).\r\n\r\nI would like to share my personal experience on this topic, because I believe a good Technical Lead is a key role within most (/ all) development teams.","abstract":"Everything you want(ed) to know on your first day as a Technical Lead and that you can use every day from that point onwards.","audience_level":"Intermediate","talk_format":"DEV@SATURN Talk (15 minutes)"}}
{"index":{"_index":"submissions","_type":"201701182236"}}
{"id":7384,"state":"submitted","confirmed":false,"created_at":"2016-12-30T14:11:20.301Z","updated_at":"2016-12-30T14:11:20.301Z","additional_info":"N/A","rating":62.5,"trust":100,"tag_list":[],"profile":{"name":"Jim van der Waal","bio":"I'm an IT Project Manager at bol.com, the biggest e-commerce company within The Netherlands and Belgium. With my creativity and passion I try to develop a drive in the company that will make things happen.","twitter":"","company":"bol.com","url":"","shirt_size":"Men's M","email":"jimvdwaal@gmail.com","location":"#<OmniAuth::AuthHash country=#<OmniAuth::AuthHash code=\"nl\"> name=\"Rotterdam Area, Netherlands\">"},"talk":{"title":"Abuser stories: how we embedded a security culture within our business.","description":"With bol.com we experienced the flight ecommerce took the last decade. As the biggest ecommerce company of the Netherlands and Belgium security risks grew exponentially. But it’s not scalable to let your security team grow with the same rate. That’s why we also focused on creating a security culture within the company: making security a responsibility of everyone, not only the security team.\r\n\r\nTo not only create this culture in IT but also in the rest of the company, we organized Abuser Story workshops for Product Owners and Business Analysts. Abuser stories are a fun way of thinking about the security of your new features. It triggers to think of unhappy flows, think of thresholds to monitor and so on. Making the systems Secure by Design, something really relevant for architects. We saw that Product Owners consulted the security team and architects way more for advice when designing new systems, they gave room and time to developers to write secure code, and discussions between the Security and development teams were actually constructive. It helped to get the “security, we are in this together” mindset. \r\n\r\nIn this talk Jim will tell the journey of bol.com, the growing importance of security, and the way we tried to cope with it in a fun way. The lessons learned are valuable for every (growing) company that struggles with making security scalable, and assuring that you will not only be secure today or tomorrow but also in 5-10 years.\r\n","notes":"Creating awareness in (IT) companies regarding security is becoming really important, and we saw that this awareness should extend way beyond IT. This is really necessary if you want to work agile, and I experienced that first hand. That is why I came up with this concept to extend the security culture to the business as well. Since it is more or less something I came up with myself I am very enthusiastic and passionate to talk about it. Especially since I experience the succes from it every day now in my projects. ","abstract":"How do you cope with the growth of security risks? Creating a security culture in your company becomes more important every day. Providing your IT teams with the right tools is one thing, but new features start way before it reaches the development phase. So how do you create such a culture?","audience_level":"Beginner","talk_format":"DEV@SATURN Talk (15 minutes)"}}
{"index":{"_index":"submissions","_type":"201701182236"}}
{"id":7723,"state":"submitted","confirmed":false,"created_at":"2017-01-08T09:56:24.548Z","updated_at":"2017-01-08T09:56:24.548Z","additional_info":"Meeting Web Accessibility Guidelines: https://www.pluralsight.com/courses/web-accessibility-meeting-guidelines\r\nIntro to Web Accessibility: https://forwardcourses.com/workshops/50\r\nChoosing an Accessible UI Framework: https://www.youtube.com/watch?v=BsdoIYT5hdc\r\n","rating":50.5,"trust":50,"tag_list":[],"profile":{"name":"Gerard Cohen","bio":"> \"Do you ask a dolphin how it swims, or an eagle how it flies? No, because that's what they were made to do\" \r\n\r\nGerard K. Cohen loves front end engineering so much that he is on a mission to make sure that the web is inclusive to all users, making rich internet experiences available for all. He believes great Ux includes performance and accessibility. \r\n\r\nGerard lives in Oakland with his wife and Betta fish, Squiggles. When he is not sleeping or drinking Zombies at tiki bars, he helps raise awareness by speaking at Front End and Accessibility conferences around the country, as well as producing a on accessibility for Pluralsight. During the day though, he is the Lead Accessibility Strategist at Wells Fargo.","twitter":"gerardkcohen","company":"Wells Fargo","url":"","shirt_size":"Men's XL","email":"gerardkcohen@gmail.com","location":"Oakland, CA"},"talk":{"title":"Accessibility Testing Tools for Developers","description":"You don't have to be an accessibility expert to make your projects accessible, but you do have to make your projects accessible. \r\n\r\nIdentifying accessibility issues as early as possible can save an organization or project a substantial amount of money, time, and headaches over trying to augment a web site or application after initial development. Using a testing tools during development for accessibility will definitely help with this process. \r\n\r\nFor developers that are novice to web accessibility this presentation is a great introduction into key aspects to consider while developing. For developers that are more familiar, this presentation exposes tools that will make accessibility easier. All users will gain from learning how to build accessibility into their development workflow using a variety of testing tools, from simple to intricate. ","notes":"This is generally a 60 minute presentation that can easily be expanded to fill 90 minutes.","abstract":"You don't have to be an accessibility expert to make your projects accessible, but you do have to make your projects accessible. This presentation can serve as an introduction to web accessibility by exposing what to look for, via a variety of tools, to help developers make projects inclusive to all","audience_level":"All","talk_format":"Tech Talks and Tech Tutorials (30 or 90 minutes - please specify the exact time in the Notes section)"}}
{"index":{"_index":"submissions","_type":"201701182236"}}
{"id":8060,"state":"submitted","confirmed":false,"created_at":"2017-01-15T05:42:07.234Z","updated_at":"2017-01-15T05:42:07.234Z","additional_info":"N/A","rating":83.3333333333333,"trust":75,"tag_list":[],"profile":{"name":"Pradyumn Sharma","bio":"32 years of experience in IT industry. Been a programmer, designer, architect, project manager, DBA, tester, business analyst, and now mostly trainer, coach and consultant. I have worked on the architecture, design and implementation of many applications, in various domains including banking, insurance, retail, logistics, process control. I regularly provide consulting, coaching and mentoring services to software development organizations in India on grooming their experienced developers to play the role of application / solution / enterprise architects. I have designed and executed many in-depth training programs on various aspects of architecture for my clients.\r\n\r\nBeen a speaker in many SATURN conferences, as well as Scrum Gatherings, Agile Conferences.","twitter":"PradyumnSharma","company":"Pragati Software Pvt Ltd","url":"","shirt_size":"Men's XL","email":"pradyumn.sharma@gmail.com","location":"Unknown"},"talk":{"title":"Agile Architecture and Design","description":"Agile software development methodologies are mainstream now. But one of the nagging questions teams face is: how to establish the architecture for a system the agile way? After all, architectural decisions have a key impact on various qualities of a system, and therefore, these decisions have to be taken early and carefully. How does this fit with the incremental and iterative nature of agile methodologies? \r\n\r\nIn this session, I'll cover the following aspects: \r\n\r\n* Creating an architecture vision, including desired architectural qualities, during Sprint Zero \r\n* Identifying potential strategies for achieving the desired architectural qualities, without creating an ivory tower architecture\r\n* Prioritizing the architectural qualities and adding them to the Product Backlog along with the functional requirements \r\n* Implementing and verifying architectural qualities with the help of real stories from the Product Backlog.   \r\n\r\nI will take concrete examples from projects on how to apply the above concepts.","notes":"I have been in the IT industry for 32 years. Been a programmer, designer, architect, project manager, DBA, tester, business analyst, and now mostly trainer, coach and consultant. I have worked on the architecture, design and implementation of many applications, in various domains including banking, insurance, retail, logistics, process control. \r\n\r\nI regularly conduct training programs in the fields of Agile with Scrum, Agile Engineering Practices (XP), Solution Architecture, Enterprise Architecture, and Writing Good Programs.\r\n\r\nI have presented various sessions relating to Agile Architecture in many SATURN conferences, as well as Scrum Gatherings, Agile Conferences.","abstract":"How to establish the architecture for a system in an agile way? How to avoid BDUF, and yet meet the architecture requirements and mitigate the risks aggressively? Concrete examples from projects to understand the concepts as well as practical insight.","audience_level":"Intermediate","talk_format":"Experience Report Presentation (30 minutes)"}}
{"index":{"_index":"submissions","_type":"201701182236"}}
{"id":8186,"state":"submitted","confirmed":false,"created_at":"2017-01-16T23:06:37.474Z","updated_at":"2017-01-16T23:06:37.474Z","additional_info":"N/A","rating":50,"trust":25,"tag_list":[],"profile":{"name":"Babu Samuel","bio":"I have been working in IT for about 20 years. For the past 7 years, I am working as an architect and a technical lead in SIEMENS healthineers at Princeton, New Jersey. ","twitter":"","company":"SIEMENS","url":"","shirt_size":"Men's L","email":"bsamuel25@gmail.com","location":"Unknown"},"talk":{"title":"Agile With Architecture","description":"Over the past few years, there is a question central to many discussions surrounding agile approaches to architecting software: In agile process, is the architecture of the system designed up-front, or does it emerge over time as the result of the agile software development process? Also there is an importance of supporting evolution and change to a software-intensive system, and the practical implications of creating a change-ready system. The ability to adapt these changes is driven by two factors, Architecture and Agile Practices. This presentation shows some of the techniques an architect can use to be effective in the fast moving agile environments.\r\n1.\tA hybrid form combining both explicit and emergent architectural techniques. This approach explains\r\n\t      (i) How alignment is the part of architectural work where an architect makes sure that the solution fits its mission?\r\n\t      (ii) How distilling the direction of change, and designing the domain essence are explicit architectural activities?\r\n\t      (iii) How creating the detailed structure, and designing the domain essence can be done in an emergent way\r\n2.\tTrace the history of software development practices from waterfall phases through iterative design to agile techniques. These include\r\n\t      (i)The implementation of a project lifecycle selection framework\r\n\t      (ii) An approach for tailoring any defined method\r\n\t      (iii) A consideration of all elements of a development environment\r\n\t      (iv) Incremental adoption of change\r\n\t      (v) The implementation of a CoE (Center of Excellence)\r\n3.\tHow to identify the right amount of architecture by looking at the problem being addressed from a different perspective?\r\n4.\tHow to minimize rework through reasonable foresight and prototypes?\r\n5.\tHow to accelerate delivery through early integration, continuous testing and automated deployment pipeline?\r\n","notes":"Over the past few years, I am working on projects where the requirements are not fully defined up front. Also we are following an iterative approach to refine the requirements. So creating architecture and bringing the changes in each iteration is a real challenge. In this talk, I am going to talk about how the hybrid technique (using explicit and emergent architecture) will help to overcome some of the challenges. Also my talk will be based on the challenges I am facing on my current projects. ","abstract":"In agile process, is the architecture of the system designed up-front, or does it emerge over time as the result of the agile software development process? The ability to adapt and innovate is driven by Architecture and Agile Practices. This paper shows the techniques an architect can use in agile.","audience_level":"Intermediate","talk_format":"DEV@SATURN Talk (15 minutes)"}}
{"index":{"_index":"submissions","_type":"201701182236"}}
{"id":6278,"state":"submitted","confirmed":false,"created_at":"2016-11-07T11:14:27.807Z","updated_at":"2016-12-07T14:56:00.782Z","additional_info":"N/A","rating":87.5,"trust":100,"tag_list":["docker","containers","hands on"],"profile":{"name":"Len Bass","bio":"Len Bass is an award winning author who has lectured widely around the world. His books on software architecture are standards. His new book on DevOps is in the words of an Amazon reviewer \"... the first DevOps book that shows a realistic and achievable view of the full implementation of DevOps\" He has over 50 years experience in software development, 25 of those at the SEI. He also worked for three years at NICTA in Australia and is currently an adjunct faculty at Carnegie Mellon teaching a course in DevOps.","twitter":"","company":"Carnegie Mellon University","url":"","shirt_size":"Men's L","email":"len.bass@gmail.com","location":"Unknown"},"talk":{"title":"A Hands on Introduction To Docker","description":"Have you heard the term \"container\" without a full understanding of what it means? This is the place for you. This session will provide some of the theory of containers and provide a supervised hands on experience where participants will construct a Docker container. They will execute the container and save it in a repository so that they can some day show their children - \"This was my first container\".\r\n\r\nParticipants should have preloaded Docker and run the Hello World application","notes":"","abstract":"Containers are light weight virtual machines that have become default packaging mechanisms for the deploying of systems. Docker is the pre-eminent container system. \n\nI will provide some explanations of how containers work and the participants will build,execute, deploy, and save a container. \n\n","audience_level":"All","talk_format":"Participatory Session (90 minutes)"}}
{"index":{"_index":"submissions","_type":"201701182236"}}
{"id":7892,"state":"submitted","confirmed":false,"created_at":"2017-01-11T14:17:37.160Z","updated_at":"2017-01-11T14:19:09.807Z","additional_info":"https://vimeo.com/146097041\r\nThis is an example from the Lean Kanban Central Europe conference in Munich.\r\n\r\n","rating":100,"trust":100,"tag_list":["architecture","complexity","cynefin","sensemaking","experiments","change","teams and organizations"],"profile":{"name":"Ken Power","bio":"Ken is a Principal Engineer with Cisco Systems, where he works with teams and organizations around the world. His work and research interests include software and systems architecture, agility, lean thinking, flow, complex adaptive systems, organization effectiveness, and software engineering management. He is a frequent speaker on these topics at major international agile, lean, and software engineering conferences. Ken is a Fellow of the Lean Systems Society. His PhD research is in the application of flow-based software development and complex adaptive systems to software teams and organizations. He has published numerous papers on agile, lean, and software engineering, including winning the IEEE Software best paper award.","twitter":"ken_power","company":"Cisco Systems, Inc.","url":"http://ken power.ie/","shirt_size":"Men's XL","email":"ken.power@gmail.com","location":"Galway, Ireland"},"talk":{"title":"An Architect's Framework for Navigating Complexity","description":"We want our organizations and systems to be agile. We want them to evolve with the needs of the business, its customers and stakeholders, and to be resilient in the face of ever changing market conditions and the external environment. This level of adaptability and responsiveness needs to be supported by the architecture of the systems we create. The complexity of the environment that architects find themselves in is increasing in recent years, with cloud, DevOps, continuous deployment, micro services and other elements adding to the factors that architects must consider. With this growing complexity, architects need to be supported by effective decision-making approaches.\r\n\r\nSize is also a factor. Larger systems and larger organizations have, by definition, a larger number of dependencies (internal and external) that must be managed, and a larger number of stakeholders (internal and external) whose needs must be addressed. The architecture of larger systems can involve hundreds or thousands of people, creating dozens to hundreds of products, components and subsystems that all need to work together. Maintaining the conceptual integrity of the architecture under such circumstances, and over time, presents many challenges and a greater need for coherence. \r\n\r\nTo navigate all of this, agile architects need to be adaptive; they need the ability to dynamically shift their decision-making approach to match the complexity of the circumstances they face. This session will describe how lessons from complexity science, and in particular, sense making and the Cynefin framework, can help architects to be more agile in how they work, and in turn, help them develop architectures that are more agile and adaptive to the needs of the organizations they serve.\r\n\r\n### Learning Outcomes\r\n* Applying sense making in the context of architecture\r\n* Applying the Cynefin framework to architecture problems and decisions\r\n* Examples of architecture problems and decisions that can be mapped to the different domains represented by the Cynefin framework (obvious, complicated, complex, chaotic and disorder)\r\n* How to manage the transition of architecture problems between these different domains\r\n* Implications for organization structure and communications\r\n* How such an approach leads to a more resilient architecture, and a more antifragile organization\r\n* How complexity thinking and the Cynefin framework supports emergent architecture\r\n* How complexity thinking and the Cynefin framework help the organization and the architecture to be more agile\r\n\r\n### Format\r\nFor a 90-minute workshop I typically use the following format. \r\n\r\nPart 1 (5 minutes):\r\nIntroduction\r\n\r\n* Overview of concepts\r\n\r\nPart 2 (10 minutes): \r\n\r\n* Architecture descriptions\r\n* Using narrative to understand architecture\r\n\r\nPart 3 (40 minutes):\r\n\r\n* Sense Making analysis of architectures and their influence on the organisation\r\n* Analysing the patterns that emerge from the sense making activity\r\n\r\nPart 4 (30 minutes):\r\n\r\n* The Cynefin Framework, and how it applies to architecture\r\n* Designing experiments\r\n\r\nPart 5 (5 minutes):\r\n\r\n* Debrief and wrap up\r\n\r\n","notes":"The majority of the session is highly participatory. All five parts outlined in the session description have some element of participation. Parts 2-4 are the major parts of the session. In part 2, I guide participants through sketching their architecture and creating narrative about their architecture. In part 3, I guide participants in analysing their architecture/sketch/narrative using a sense making framework. In part 4, I guide participants in understanding the Cynefin framework in more detail and designing an experiment to address complex challenges that emerge in the analysis. Parts 1 and 5 have less activity, but still have dialog and interaction.\r\n\r\nI will bring all the supplies that I need to run the exercise. It is more effective if the room is set up “banquet style”, with round tables that set groups of 6-10. \r\n\r\nI have been working with sensemaking and complexity for a few years now, and have run variations of this activity many times, both inside Cisco and at conferences and other forums. At the heart of this is the concept of applying sensemaking and the Cynefin framework to managing the complexity faced by architects. That complexity is not just in the architecture itself, but also in the problem domain, the organization, and the wider context within which architects do their work.\r\n\r\nMy background is in software engineering and architecture, in the context of product and systems development, and in transforming engineering organizations around the world. I use the techniques I present here in my own work, and I also help architects, engineers, and others, apply these techniques in their work.\r\n","abstract":"To create resilient and antifragile systems, architects must use decision-making approaches that help them better navigate the complexity of their environment. Participants in this hands-on session will learn how to apply sensemaking and the Cynefin framework to architecture-related challenges.","audience_level":"All","talk_format":"Participatory Session (90 minutes)"}}
{"index":{"_index":"submissions","_type":"201701182236"}}
{"id":8176,"state":"submitted","confirmed":false,"created_at":"2017-01-16T21:16:13.848Z","updated_at":"2017-01-16T21:16:13.848Z","additional_info":"realm.io/news/360andev-chris-guzman-android-libraries-beginner/","rating":1,"trust":50,"tag_list":[],"profile":{"name":"Chris Guzman","bio":"Chris is a Developer Advocate at Nexmo where he helps developers use their global communications platform. Originally a ruby on rails developer, he made the jump into Android a year ago. He started his dev career 2 years ago after teaching himself to code. He also co-organizes the Baltimore Hackathon and the Baltimore Google Developer Group. When he’s not at conferences you can find him roaming the world.","twitter":"speaktochris","company":"Nexmo","url":"http://chris-guzman.com","shirt_size":"Men's L","email":"cguzman@orderup.com","location":"Baltimore"},"talk":{"title":"Android libraries I wish I knew about when I started","description":"There’s no sense in re-inventing the wheel when you’re working on Android apps, especially if you’re just starting out. This talk will cover a range of libraries you can include in your Android apps that will help you tackle the problems other people have already solved. Whether you’re loading data from a web api, showing & caching images, or storing & syncing data there’s a library you can pull in to help you out!\r\nNo prior knowledge of any of these libraries required. Libraries covered will include: Butter Knife, Picasso, Gson, Retrofit, Realm, Dart & Henson.","notes":"This talk will last 30 minutes. This presentation won't need anything special besides A/V setup.\r\n\r\nHaving learned the hard way when starting out in developing for Android, I have an experience that can help better inform others who are starting out. I learned a lot of lessons while starting out developing for Android and I seek to share those in this talk.","abstract":"There’s no sense in re-inventing the wheel when you’re starting out. This talk will cover a range of libraries that will help you tackle the problems other people have already solved. Whether you’re loading data from a web api, showing images, or syncing data there’s a library that can help you out!","audience_level":"Beginner","talk_format":"Tech Talks and Tech Tutorials (30 or 90 minutes - please specify the exact time in the Notes section)"}}
{"index":{"_index":"submissions","_type":"201701182236"}}
{"id":8185,"state":"submitted","confirmed":false,"created_at":"2017-01-16T22:46:25.924Z","updated_at":"2017-01-16T22:46:25.924Z","additional_info":"https://www.youtube.com/watch?v=_TeMYF_JjNg","rating":100,"trust":50,"tag_list":[],"profile":{"name":"Sebastian von Conrad","bio":"Sebastian heads up the software architecture efforts at Envato, where he helps solve difficult technical problems for some of Australia's largest websites. He is a former Development Manager and Developer, and was recently President of Ruby Australia. He's spoken at conferences in Australia and abroad, including Agile Australia, RubyConf, and SATURN.\r\n\r\nGrowing up in Sweden, Sebastian now lives in Melbourne, Australia. It was about the last place he ever thought he'd visit, yet alone live. After 8 years and counting, however, he has no plans of leaving--at least not until he actually sees a snake.","twitter":"vonconrad","company":"Envato","url":"","shirt_size":"Men's M","email":"sebastian@vonconrad.com","location":"Melbourne, Australia"},"talk":{"title":"An In-Depth Look at Event Sourcing with CQRS","description":"Although Event Sourcing has been around for many years, it remains outside the mainstream paradigm of software development--much to our detriment.\r\n\r\nBy placing the highest value on the simple capture of essential business events without attempting to interpret them, and by relegating all interpretations of those events to completely disposable subsystems, Event Sourcing enables us to move faster by supporting rapid experimentation with new perspectives, new user interactions, and new insights into your business. Without needing to predict the future, we are in a much better position to respond to it when it arrives.\r\n\r\nEvent Sourcing is agnostic of technology stack and language style, but it goes well with another pattern called CQRS: Command Query Responsibility Segregation. In this talk, we will do a deep-dive into the two patterns and scope out a system that has:\r\n\r\n* Receiving and validating Commands that, if successful, result in Events.\r\n* Interpreting Events into denormalised projections for very fast reads.\r\n* Single responsibility services for reacting to Events by creating other events and, if necessary, triggering external behaviour.\r\n\r\nWe will also cover more in-depth topics, such as:\r\n\r\n* Strategies for evolving events and event schemas over time.\r\n* Dealing with eventual consistency.\r\n* Popular technologies for various system components.","notes":"This is a 90 minute talk. I gave a 30 minute version of this talk at SATURN 2016, which was very well received. I thought I'd see if there was interest in a longer version to expand on the many questions that followed. You can see the 2016 talk here: https://www.youtube.com/watch?v=_TeMYF_JjNg\r\n\r\nSince last year, my involvement in building Event Sourced systems have grown exponentially. My company, Envato, has continued building Event Sourced systems and has emerged as a leader for this particular pattern in Australia. As the principal Software Architect at Envato, I have been a key part of this journey, which has also involved speaking with a variety of other companies about their Event Sourcing experiences.\r\n","abstract":"Event Sourcing is an approach to building software with a long track record of success. By placing business concepts at the heart of our code, we can decouple systems into small services that can be quickly built, changed, and replaced. This talk will show you how.","audience_level":"All","talk_format":"Tech Talks and Tech Tutorials (30 or 90 minutes - please specify the exact time in the Notes section)"}}
{"index":{"_index":"submissions","_type":"201701182236"}}
{"id":7397,"state":"submitted","confirmed":false,"created_at":"2016-12-30T20:16:16.478Z","updated_at":"2017-01-11T17:03:22.268Z","additional_info":"I have taught this class to hundreds of developers over the past year with excellent reception. A previous course I have taught is https://mva.microsoft.com/en-US/training-courses/getting-started-with-template-10-16336?l=R3bBb1LRC_4305918554 and https://mva.microsoft.com/en-US/training-courses/developing-universal-windows-apps-with-c-and-xaml-8363","rating":17.3333333333333,"trust":75,"tag_list":["html","ios","android","windows","user experience"],"profile":{"name":"Jerry Nixon","bio":"A Developer Evangelist for Microsoft in Colorado, Jerry teaches and speaks on Mobility and Enterprise development. He started his career delivering data-centric solutions while “database developer” was still a novel term. He received a civilian Naval Commendation for security work, preceding his work for the startup that became Microsoft Dynamics. For two decades now, Jerry has built solutions and taught design patterns and UX best practices to thousands of developers around the world. Jerry spends the bulk of his free time teaching his three daughters Star Trek character backstories and episode plots.","twitter":"jerrynixon","company":"Microsoft","url":"http://jerrynixon.com","shirt_size":"Men's L","email":"jnixon@microsoft.com","location":"Colorado"},"talk":{"title":"An invisible app? An Introduction to Inclusive Design & Fundamental User Experience Best Practices","description":"An invisible app? An Introduction to Inclusive Design & Fundamental User Experience Best Practices\r\nI know what you're thinking. You want to know what the triple-A app titles already know. It's Inclusive Design, a process to deliver intuitive usability; it is the heart-and-soul of great User Experience and innovative interactions. Your app is in a cosmic battle with the Uninstall button; inclusive design changes the nature of your app, tipping the scales in your favor. Appeal to your largest audience, provide cohesive experiences, and reduce development costs. It is an investment with one of the best returns in all of software. It's simple, cheap and awesome.\r\n\r\nApplication security is fundamental to software from initial design to every line developed. Security should not be an afterthought. Similarly, usability has this same ubiquity throughout the life-cycle of software. The fastest, most secure, most scalable software can end up in the trash because it misses the most important success criteria for any program in the universe - user acceptance. Software architecture profoundly impacts usability. Usability profoundly impacts acceptance. Architects may not choose app colors, error messages, and device layout, but they certainly make choices that enable and constrain designers options that make our software better. Like security is everyone’s responsibility at some level, so is usability at some level.\r\n\r\nWhat will attendees learn? Inclusive design isn’t only usability; it’s recognizing that your user base changes as their social and environmental contexts change. If your user is standing in the sun, waiting for a train in the snow, holding a baby, riding a bus, visiting a library or watching the big game in a sports bar, applications can account for the one type of user that, given a certain context, looks and acts like another type of user. Inclusive design helps developers understand these contexts. It applies these to our implementations to add modalities, flexibility in workflows, and intentional tolerance for user mistakes. Developers will learn to recognize contextual assumptions and apply new, potential contexts to their existing user base so they can serve them best while consequently serving a new, larger user base. ","notes":"This is a 90 minute talk.\r\n\r\nThe structure of the talk includes:\r\n1. Introduction to basic user types\r\n2. Introduction to core user contexts\r\n3. Examples of design assumptions\r\n4. Examples of coding mistakes\r\n5. Examples of app wins\r\n6. Easy changes to the UI you can make today\r\n7. Easy changes to the code you can make today\r\n8.  Fundamental changes to code you can make next time","abstract":"I know what you're thinking. You want to know what the triple-A app titles already know. It's Inclusive Design, a process to deliver intuitive usability.","audience_level":"All","talk_format":"Tech Talks and Tech Tutorials (30 or 90 minutes - please specify the exact time in the Notes section)"}}
{"index":{"_index":"submissions","_type":"201701182236"}}
{"id":7391,"state":"submitted","confirmed":false,"created_at":"2016-12-30T17:19:45.700Z","updated_at":"2017-01-13T22:29:45.162Z","additional_info":"[Ethics as a Quality Attribute](https://www.youtube.com/watch?v=FSbZpUo2E1E&index=52&t=2s&list=PLSNlEg26NNpy1RjhlISNMRNO1gypYaXHo)\r\n\r\n[Joe Runde](https://www.papercall.io/speakers/rundemc) will be a co-presenter for this talk","rating":100,"trust":100,"tag_list":["agile","lean","github","design","adr","documentation","software architecture"],"profile":{"name":"Michael Keeling","bio":"Michael Keeling is a software engineer at IBM where he helps build Watson and has worked in the software industry for over a decade.  He is author of the forthcoming book, [Design It!: From Programmer to Software Architect](http://amzn.to/2ipIpme).  Keeling has a Masters in Software Engineering from Carnegie Mellon University and a BS in Computer Science from the College of William and Mary.","twitter":"michaelkeeling","company":"IBM","url":"http://neverletdown.net","shirt_size":"Men's L","email":"michael.keeling@gmail.com","location":"USA"},"talk":{"title":"Architecture Decision Records in Action","description":"Documenting architecture design decisions is commonly considered a good practice but few teams take the time to write down the decisions they make.  In my experience this happens for a few reasons:  architecture documentation is rejected as being too heavyweight, documentation is typically out of sight and out of mind, and many developers don't know what to document.  Architecture Decision Records (ADRs), a lightweight documentation approach [proposed by Michael Nygard](http://thinkrelevance.com/blog/2011/11/15/documenting-architecture-decisions), solves these problems by recording design decisions in a simple markdown template in the same repository as the code affected by the ADR.  In this talk we will share our experiences and lessons using ADRs over the past year while working on multiple projects for IBM Watson.\r\n\r\nBy the end of this talk you will be able to create effective ADRs, introduce them to your team, and avoid common pitfalls with the method.","notes":"This talk is intended to be a 30 minute experience report.  I can't figure out how to change the session type to match this.\r\n\r\nThe talk will have the following tentative outline.\r\n\r\n1. Introduction / Problem overview: teammates don't have architectural context, decisions aren't communicated and are lost over time\r\n   * Failed attempts to solve the problem -- wikis, dedicated repos, \"official\" documentation\r\n2. ADRs Overview\r\n   * Nygard's proposal\r\n   * Connection to other work and research\r\n3. How we use ADRs\r\n4. Exercise: Create an ADR (optional, may fall out depending on timing, at most this is a 5-7 minute exercise)\r\n5. Case Study: IBM Watson Information Retrieval Enhanced team\r\n   * This section will include the proposed lessons and tips for adopting and using ADRs based on our experiences\r\n   * Create a common template that everyone agrees to use\r\n       * examples from case study\r\n   * Identify an architecture champion to point out when architectural design decisions happen\r\n   * Add ADR creation tasks to the backlog\r\n   * Use pull requests and peer reviews to teach people how to record a decision and to\r\n       spread konwledge about decisions\r\n   * Use ADRs to grow architects on your team\r\n       * Creating an ADR is a small slice of design responsibility.  It turns out to be a great way to\r\n           infuse the team with architectural thinking and train new architects\r\n   * Store ADRs with the code\r\n   * Works great with microservices where small groups of people and the code\r\n       they create work autonomously within a light governance framework\r\n   * Revisit old ADRs every so often to update them and ensure you have accurate reflection of current thinking\r\n6. Problems we ran into with ADRs and are still working through\r\n   * Plain text diagramming is a pain point.\r\n   * ADRs emphasize architectural decisions for a single component.  This is great for smaller projects and\r\n      individual microservices but falls apart when multiple architectural components stored in multiple code\r\n      repositories are involved.\r\n      * Our solution was to create an \"Architecture\" repository, which stored ADRs that cut across multiple\r\n         architectural components, linking to refinement ADRs as appropriate.\r\n   * Overemphasis on design decisions at the expense of other design documentation\r\n       * The team became awesome at recording ADRs to the point where they wouldn't document anything else!\r\n       * ADRs were smashing success.  Complementary methods that are as simple and lightweight are needed for\r\n          design concepts other than decisions.  examples: alternatives, governance policies, general design guidance,\r\n          quality attribute scenarios and other architecturally significant requirements\r\n7. Conclusion\r\n   * closing thoughts on using ADRs as a way to \"sneak in\" architecture\r\n   * great way to create a history of the project and explain not only where we are but how the system arrived at this point\r\n   * Show where ADRs fit as part of an documentation strategy \r\n   * Links to additional resources","abstract":"Architecture Decision Records (ADRs) capture key architectural design decisions in a lightweight, easy-to-create, plain text template stored in your existing version control system.  In this talk we will explore case studies from the IBM Watson IR Enhanced team and learn how to use ADRs.","audience_level":"All","talk_format":"Experience Report Presentation (30 minutes)"}}
{"index":{"_index":"submissions","_type":"201701182236"}}
{"id":8273,"state":"submitted","confirmed":false,"created_at":"2017-01-18T19:18:28.969Z","updated_at":"2017-01-18T19:18:28.969Z","additional_info":"This is a link to another drum talk I do. My video from THIS drum talk from Agile West is not yet edited.\r\n\r\nhttps://youtu.be/ePt9UlV_wtw","rating":0,"trust":0,"tag_list":[],"profile":{"name":"John Ryskowski","bio":"John Ryskowski has been helping organizations transform themselves and increase their capability since 1989. He is particularly interested in the social entanglements that preclude progress as organizations work to create their vision, identify actions, and achieve goals. He also happens to have been studying and playing drum set professionally for the last 35 years. So after two years of subconscious nagging finally put together a series of “drum talks.” John holds a MA in Education from California Lutheran College, a BA in Mathematics from California State University Northridge, is a Problem Solving Leadership graduate, CSM, and a CMMI High Maturity Lead Appraiser for services and development. jfryskowski@yahoo.com 310 937 6077 Jfr-consulting.com","twitter":"","company":"JFR Consulting","url":"https://www.jfr-consulting.com","shirt_size":"Men's L","email":"jfryskowski@yahoo.com","location":"#<OmniAuth::AuthHash country=#<OmniAuth::AuthHash code=\"us\"> name=\"Greater Los Angeles Area\">"},"talk":{"title":"A software architect and a big band drummer walk into a bar, and their parallel universes collide. ","description":"The software architect is the lone carrier of DNA for the vision of the product, but does not work alone. He/she is placed on a project (“situation”) where he/she must still deliver. The big band drummer can single handedly guide a band, and is placed on a gig (“situation”) where he/she must deliver. What is at the core of the big band drummer’s DNA to bring about success and what parallels might we draw between the two? Come and find out.\r\n\r\nSometimes the most efficient way to a fresh perspective is to sit in the seat of someone else from a totally unrelated field. Reading Harvard Business Review, competitive companies seek advice from totally unrelated fields to solve their most difficult problems. So why should it be any different for software architect?  The software architect’s role in leading teams and influencing business decisions cannot be overlooked. \r\n\r\nJohn Ryskowski would love to reveal the big band drummer’s strategy for success and its attendant parallels to the software architect’s “situation.”  Of course, band stories and drumming demonstrations will be included.\r\n","notes":"Session Requirements:\r\n1) To start a conversation that will last throughout the rest of the conference. \r\n2) To obtain a “fresh perspective” by taking folks down the path of a totally unrelated field and drawing pertinent parallels for and with them. \r\n3) As an architect one must create and nurture the vision for the DNA of the product, in spite of the project situation. The big band drummer must nurture a good sound from the big band, in spite of the gig situation. The parallels between the two should be realized, discussed, and brought to grounded historical experiences for each attendee. \r\n4) To introduce some new language that may help put project situations into perspective allowing one to return to clarity of thought. Psychologically speaking we get some relief from having name for some events or techniques. For example, I need to vary my intensity to get the group affect that I desire.\r\n\r\nThe session breakdown:\r\nHandouts: The actual drum chart for the subject of the talk- Kubis’ arrangement of “A Train,” and the “Clapping at Camp” chart written for audience participation. Big sticky papers will be on the walls of the room. \r\n\r\n1) Explain how one path to a fresh perspective is to experience something that is totally unrelated, but at the same time reveals grounded parallels to your situation. Executing a big band chart requires a strategy with known techniques but the flexibility to grab opportunities to inspire and transcend the moment. Through subtle and timely queues, the drummer can instill a sense of confidence and inspire the band to play better than they imagined. The techniques we discuss could have the same effect for the people on the architect’s project.\r\n2) Through demonstration, we discuss some of the possible variations the drum set can offer. This would include the elements of the drum set with each of their different sounds, the 4 limbs of the body, and just some of the combinations thereof. We will stick with the combinations that are most pertinent for this talk, and don’t forget the eyes and brain play a role as well. \r\n3) We get into a discussion about some of the situations the big band drummer must deal with. Does the band leader know little about music (or does the manager of the program or product owner know little about the technology)?  Does the lead trumpet think he is with the Count Bassie band (or is your development principle unaccustomed to this environment)? Can the bass player not play in time (or does your development principle have no sense of time)? Is the drum set in the absolute worst location to work with the rest of the band (or are you stuck without a reasonable means of communication with the rest of the team)? I will demonstrate how the big band drummer overcomes each of these situations. \r\nI then ask each member of the audience to choose which situation they resonate with most. Audience members will then join 1 of 4 groups to discuss their personal situations, their solutions or possible solutions then elect the top 3 solutions to brief the rest of the other groups. \r\n4) Two vital techniques in big band drumming are then discussed: “Distinguishing signal from noise” knowing the current location of the chart without listening to anyone’s sense of time, and “Some of your great ideas may not be so great.” The audience will then be asked to verbalize their own parallels, and If the interest and energy are present, we can briefly split into two groups, discuss and brief.\r\n5) The “Kubis” chart is then projected on the screen and actually played on the drum set asking the audience to try and observe, as best they can, all that is going on with the drum set performance. We then deconstruct each element of successful drum chart execution. Each element and a lesson to take away:\r\na) Element- Initiating and maintaining a tempo for the band. Lesson- What is least exciting for you may be most important to them.  You set the tone for what is to come and instill a sense of calm. Sometimes you’re just a piece of leverage. Wow that last one hurt.\r\nb) Element- Identify milestones. Lesson- Marking points in time to celebrate progress, ensure social/technical alignment, and instill confidence.\r\nc) Element- Vary intensity as needed. Lesson- Selectively applying energy at the right times and in the right places, balancing support, teaching, and inspiration.\r\nd) Element- Special care. Lesson- Sometimes hand-holding is necessary.\r\ne) Element- Set them up for success. Lesson- Anytime you set someone up for success, they feel good and want to work with you. \r\nThe audience is once again, asked to choose which of these they resonate with most. Audience members will then join 1 of 5 groups and discuss their personal situations (or parallels) amongst their group. Each group will then brief the other groups. \r\n6) The “Clapping at Camp” chart is introduced. I show how without even being able to read music (or a rhythm chart) I can still set them up for success. We rehearse the sections of the chart. Then we perform the chart together and they clap in time like they were born to do it. It’s really fun.\r\n\r\nPresentation History\r\nThis topic has been presented at Agile West, Las Vegas, 2016. \r\nSummary score of 8.69. Total attendees 45. Total of 4 written comments here verbatim:\r\n1- Fun! Fun! Fun! Perspective and musical metaphor\r\n2- Novel application and most engaging session by far! \r\n3- Very unique, engaging, and appropriate. One of my favorite presentations and many parallels were illustrated.\r\n4- Content was delivered in a muddled way. Good points were buried in musician stories and metaphors.\r\n\r\nReferences to Speaking Ability\r\nI like to pull people out of their everyday situations, immerse them into something completely different that is fun and interesting, then help them to draw parallels back to their everyday situations. This is an efficient path to a fresh perspective, which is the most valuable take-away from any conference.  \r\nThe ideal reaction cycle I strive for is: a) I wonder what that would be like, b) cool I didn’t know that, c) whoa I need to try this out. \r\nI have spoken at Agile West, CMMI Institute Conferences, Pacific Norhwest Software Quality Conference, National Defense Industrial Association. I have also delivered good and bad news to leaders of many corporations. \r\n\r\nReferences: \r\nKerry Trujillo,  Kerry_Trujillo@raytheon.com, see linkedIn recommendation\r\nMichael West, michael@naturalspi.com\r\n","abstract":"How does the architect ensure a great product, in spite of, well, the situation at hand? How does a big band drummer ensure great music, in spite of, well, the situation at hand? The parallels will entertain and surprise you, and maybe, bring about a fresh perspective that is difficult to achieve.","audience_level":"All","talk_format":"Participatory Session (90 minutes)"}}
{"index":{"_index":"submissions","_type":"201701182236"}}
{"id":7179,"state":"submitted","confirmed":false,"created_at":"2016-12-15T21:54:56.213Z","updated_at":"2017-01-11T17:42:03.113Z","additional_info":"https://www.youtube.com/watch?v=m-RBaNTGJSk&list=PLvk9Yh_MWYuwTYjxOqjzOlVmFFHvN3Yp7&index=1&t=3s","rating":100,"trust":75,"tag_list":["30-min tech talk","pipelines","jenkins","continuous delivery","cd","ci","continuous integration","automation","docker","containers"],"profile":{"name":"Avantika Mathur","bio":"Avan is a Global Technical Account Manager at Electric Cloud. She helps large enterprises across Finserv, Retail and Embedded accelerate their DevOps adoption. Avan is working with customers to design complex automation solutions and optimize their delivery pipeline to speed up software-driven innovation and increase Agile throughput. Avan holds a degree in Computer Science. Prior to Electric Cloud, she worked as a software engineer at IBM for five years as a Linux kernel developer.","twitter":"avantika_ec","company":"Electric Cloud","url":"http://electric-cloud.com/blog/","shirt_size":"Women's S","email":"oheel@catapultpr-ir.com","location":"Los Angeles, CA"},"talk":{"title":"Automate ALL the Things: Taking Advantage of Free Tools to Automate Your End-to-End Release Pipelines","description":"A myriad of point-tools, frameworks and infrastructures are involved in your software delivery process – from development, through build, testing, deployment, all the way to a Production Release.\r\n\r\nWhile many of these tools are free/open source, the operational and technology overhead of orchestrating the hand-offs from one tool to the next in the process are not without cost.\r\n\r\nTo improve developer productivity and resource utilization – and to enable enterprise-scale, cross-project visibility and shorter time to market – organizations are working to automate and orchestrate the entire tool chain across the end-to-end delivery pipeline.\r\n“Automate All the Things” is a key tenant to any DevOps or Continuous Delivery initiative.\r\n\r\nThis presentation will use a real case study to show how you can orchestrate your entire software delivery pipeline. Learn how to create a fully-automated release pipeline, tying-in common tools that you likely use in your process from CI build to Release: including Git, Jenkins, Selenium, Chef, Docker, and more.\r\n\r\nLearn how to:\r\n\r\nSeamlessly orchestrate third-party tools to automate your entire process- from start to finish\r\n\r\nGet visibility into your end-to-end application release pipeline\r\n\r\nDeploy any application to any environment using any tool-set – for free.","notes":"As Global Technical Account Manager at Electric Cloud, I work with some of our largest customers, and help them use our solutions to improve their software development and delivery processes.  I help with overall strategy deploying our software across large organizations, design and implementation, as well as looking ahead to make sure the solution support future growth plans. Before joining Electric Cloud, I worked as a kernel developer at IBM for five years. \r\n\r\nI have previously presented at StackWorld 2016, StackWorld Virtual 2016, and Merge 2016. \r\n\r\nOutline: \r\n\r\n1. What does your software delivery pipeline look like?\r\n2. What is a Commit Pipeline vs. Release Pipeline\r\n3. How do you ensure fidelity of processes, environments, configuration and artifacts across the pipeline- from code check-in to Production\r\n4. What point tools are involved in your pipeline, how many are open source/free?\r\n5. What are the challenges with managing a myriad of tools, across different teams\r\n6. Don’t replace your existing tools, orchestrate.\r\n7. What is the difference between automation and orchestration\r\n8. What do you need for end-to-end orchestration\r\n9. A little bit about ElectricFlow – a free devops orchestration platform\r\n10. What are the benefits and ROI of orchestration of the pipeline\r\n11. Consider a common pipeline using free tools- from developer check-in with Git, through CI with Jenkins, Publish to repo w/ Docker, then to Staging for testing, run Selenium tests, upon success- deploy to Docker in Prod.\r\n12. DEMO of this pipeline – orchestrating all the free tools with ElectricFlow.","abstract":"This presentation will use a real case study and a live demo to show how you can orchestrate your entire software delivery pipeline.  Learn how to create a fully-automated release pipeline tying-in common tools that you likely use in your process from CI build to Release.","audience_level":"Intermediate","talk_format":"Tech Talks and Tech Tutorials (30 or 90 minutes - please specify the exact time in the Notes section)"}}
{"index":{"_index":"submissions","_type":"201701182236"}}
{"id":8165,"state":"submitted","confirmed":false,"created_at":"2017-01-16T20:01:16.808Z","updated_at":"2017-01-16T20:01:16.808Z","additional_info":"Surge 2016 video was recorded and released, though the link is no longer publicly accessible it seems","rating":0,"trust":0,"tag_list":[],"profile":{"name":"Joel Tosi","bio":"Coaching and pairing within and across teams on how to leverage new technologies to drive product learning.","twitter":"joeltosi","company":"","url":"http://www.devjam.com","shirt_size":"Men's M","email":"joel.p.tosi@gmail.com","location":"Unknown"},"talk":{"title":"Blending Product Thinking with Architecture","description":"Too much design up front and you are bumping into the design all of the time (and losing time).  Not enough design and your system can crumble in reality.  How do you blend architecture so you have the right decisions at the right time, and give them enough due dilligence?  How do you embrace cloud and microservices and not risk getting into different failure scenarios or overly complicated maintenance and ripple effects?\r\n\r\nIn this session we will walk through visualizations that help teams blend product thinking with architecture.  Along the way, we will look at microservices and domain modeling as well as chaos engineering and fault tolerance - blending all of these into a context that is consumable by all and gives the right emphasis at the right time.\r\n\r\nLeave this session with simple visualizations and approaches that you can apply immediately to start blending product with architecture, especially if you are looking to run in a cloud world.","notes":"I have been speaking, teaching, and pairing with teams leveraging these practices for year across a variety of domains - healthcare, financial, retail, etc. These approaches are simple enough to try immediately and impactful.\r\n\r\nThis would be 30 minutes","abstract":"Product Thinking - understanding the use and need  - is critical to not over engineering a product.  In this session, we explore and use simple tools that help teams blend architecture with the need of the product.","audience_level":"Intermediate","talk_format":"Tech Talks and Tech Tutorials (30 or 90 minutes - please specify the exact time in the Notes section)"}}
{"index":{"_index":"submissions","_type":"201701182236"}}
{"id":7988,"state":"submitted","confirmed":false,"created_at":"2017-01-13T07:16:01.261Z","updated_at":"2017-01-17T07:55:17.860Z","additional_info":"N/A","rating":34,"trust":75,"tag_list":["community building","architects","education","career path"],"profile":{"name":"Dmitriy Gurskiy","bio":"Senior Solution Architect, Deputy CTO at EPAM Systems\r\n\r\nTechnology stacks: .NET, JavaScript\r\n\r\nBusiness domains: Science, Finances, Insurance, Media and Advertizing","twitter":"","company":"EPAM Systems","url":"","shirt_size":"Men's M","email":"dmitriy_gurskiy@epam.com","location":"#<OmniAuth::AuthHash country=#<OmniAuth::AuthHash code=\"by\"> name=\"Belarus\">"},"talk":{"title":"Building architectural community of seven hundreds engineers in global ISV company","description":"Being a Deputy CTO in global ISV company, I 'm responsible for Solution Architecture discipline growing. I would like to share to experience of building global 700+ engineers Architectural Community. Our community includes people with Architect title (~30% of whole community) and Developers who consider Architect title as their next step in career path. Also, I will address problems/challenges that a typical software developing company meets without such community.\r\n\r\nThe experience that will be shared will include:\r\n- ways of inspiring developers to become Architects;\r\n- community building best practices we use;\r\n- challenges related to building global multi-cultural engineering community (we have offices in Eastern Europe, India, China, US, Mexico, etc);\r\n- way to involve engineers to community building activities and making the community to be a self-building one.\r\n\r\nAlso, I will share our experience in such community building/growing activities like assessments and internal educational programs that are part of professional growing for our developers and Architects. \r\n\r\nOne more interesting thing to be shared: internal \"Architectural Methodology vNext\" initiative as gravity point for community members and the basis for their future professional growth at the same time.\r\n\r\nBest practices and approaches that were used to build the community will be shared. Approach to internal educational programs in Architecture will be highlighted as well as a part of community building activities. ","notes":"Presentation agenda:\r\n1. Challenges in building engineering community\r\n2. Get globally distributed engineers together: how you can do it?\r\n3. Efficient internal educational programs in Architecture: our experience\r\n4. Internal assessments of Architects and career path","abstract":"I would like to share to experience of building global 700+ engineers Architectural Community. Best practices and approaches that were used to build the community will be shared. Approach to internal educational programs in Architecture will be highlighted as well as a part of community building. ","audience_level":"All","talk_format":"Experience Report Presentation (30 minutes)"}}
{"index":{"_index":"submissions","_type":"201701182236"}}
{"id":8030,"state":"submitted","confirmed":false,"created_at":"2017-01-14T01:23:50.452Z","updated_at":"2017-01-14T01:23:50.452Z","additional_info":"I have given a version of this talk at Clojure/conj 2016: https://www.youtube.com/watch?v=jJIUoaIvD20 I would love to adapt this to a language like JavaScript. The example code will be given in JavaScript.","rating":75,"trust":50,"tag_list":[],"profile":{"name":"Eric Normand","bio":"Eric Normand is a long time functional programmer excited to see it entering the mainstream. He loves teaching and cooking. You can learn Clojure and ClojureScript from him at [PurelyFunctional.tv](https://purelyfunctional.tv/) and read his thoughts in [*The PurelyFunctional.tv Newsletter*](https://purelyfunctional.tv/newsletter/) (formerly *The Clojure Gazette*). If you visit him in New Orleans, you can meet his wife and daughter. He'll even make you some gumbo if you tell him you're coming.","twitter":"ericnormand","company":"LispCast LLC","url":"https://purelyfunctional.tv/","shirt_size":"Men's S","email":"ericwnormand@gmail.com","location":"New Orleans"},"talk":{"title":"Building composable abstractions","description":"Do you want to create robust and composable abstractions? In this talk Eric Normand will present an iterative process to define the essence of a domain and build composability into the core. The resulting abstractions lead to more robust code at the core of your application, and can give your business a competitive advantage. We will apply this process to the Processing graphics library to develop a composable vector graphics system.","notes":"This is a 60 minute talk.\r\n\r\nAfter attending the talk, the attendee will be able to:\r\n\r\n1. Know the difference between Newtonian-style abstractions and Aristotelian-style abstractions. Aristotelian abstractions are built up piecemeal and are full of corner cases, like Aristotelian physics. Newtonian abstractions are elegant, formal, and composable.\r\n\r\n2. Follow a design process for developing an algebraic abstraction that can compose and easily express solutions (Newtonian style). Building data transformation pipelines is the step most people who are learning functional programming get to from reading and experimenting. Building algebraic abstractions is the next step, but there isn't much literature on the topic (outside of academia)\r\n    1. Elaborate a physical metaphor\r\n    2. Describe the meaning of your metaphor as mathematical statements\r\n    3. Construct the meaning using constructs from the language\r\n    4. Implement the abstraction by refactoring the meaning\r\n\t\r\n\tThe physical metaphor is an important first step that gives us an anchor from which we may use our intuition. We then query our metaphor for its properties and write them in math, which usually means types and equations. After that, we can construct a runnable version of the meaning, being careful to build it out of parts constrained by our statements from step 2. Finally, the implementation becomes an easy matter of refactoring our runnable version.\r\n\r\n\r\nThis topic idea comes from my experience teaching functional programming to people with all levels of experience. There seems to be a logical progression of insights that people go through as they learn about functional programming. I don't see many people getting past the \"data transformation\" step, so I want to present something further. It's hard to say whether it's THE next step, but it is at least one step beyond transformations.\r\n\r\nA lot of the thinking comes from my experience as a professional Clojure and Haskell programmer and the work of Conal Elliott, John Hughes, and Gerald Sussman.\r\n\r\nI have given a version of this talk at Clojure/conj 2016: https://www.youtube.com/watch?v=jJIUoaIvD20 I would love to adapt this to a language like JavaScript. The example code will be given in JavaScript.","abstract":"Do you want to create robust and composable abstractions? In this talk Eric Normand will present an iterative process to define the essence of a domain and build composability into the core. We will apply this process to the Processing graphics library to develop a composable vector graphics system.","audience_level":"Intermediate","talk_format":"Tech Talks and Tech Tutorials (30 or 90 minutes - please specify the exact time in the Notes section)"}}
{"index":{"_index":"submissions","_type":"201701182236"}}
{"id":7812,"state":"submitted","confirmed":false,"created_at":"2017-01-10T03:19:39.823Z","updated_at":"2017-01-10T03:19:39.823Z","additional_info":"N/A","rating":100,"trust":50,"tag_list":[],"profile":{"name":"Prashant Anantharaman","bio":"Prashant is a graduate student at Dartmouth College. Prashant has been a free and open source software enthusiast, being involved with the Free Software Movement India in the past during his undergraduate days. He is an active contributor to the hammer-parser ruby gem, and an advocate of language-theoretic security since he was exposed to it during an internship at SRI International. If he is not ranting out on twitter, reading papers or writing code, you might find him listening to 90s Tamil music!","twitter":"prashantbarca","company":"Dartmouth College","url":"https://prashant.at","shirt_size":"Men's L","email":"lists@prashant.at","location":"Hanover, NH, USA"},"talk":{"title":"Building Secure(r) applications using Language-theoretic security.","description":"Building Secure(r) applications using Language-theoretic security\r\n=============\r\n\r\nLanguage-theoretic security is the approach of recognizing and handling all input before processing it. Traditionally, almost every software development project mixes this recognition of input and processing of the input. If the recognition wasn't done right, then poor input can be processed and lead to exploits. \r\nLanguage-theoretic security suggests, that the recognition be separated from the processing making it easier to audit the code, and fundamentally prevent parser bugs from recurring. \r\nIn this talk, I would present an overview of Language-theoretic security and describe the parser combinator library hammer. I would then describe the approach to building language-theoretic security compliant implementations of some popular application layer IoT protocols like MQTT, and discuss the performance overhead in this approach. ","notes":"","abstract":"Parser bugs in the recent past have been infamous -- Heartbleed, Android Master Key, Apple's Goto. In this talk, I would present a  methodology using parser combinator libraries to building web and IoT applications to ensure it isn't susceptible to the same category of vulnerabilities. ","audience_level":"Beginner","talk_format":"DEV@SATURN Talk (15 minutes)"}}
{"index":{"_index":"submissions","_type":"201701182236"}}
{"id":6246,"state":"submitted","confirmed":false,"created_at":"2016-11-05T16:36:37.989Z","updated_at":"2017-01-11T17:43:36.511Z","additional_info":"https://www.youtube.com/watch?v=NSL8ONNt6Tw&t=1s","rating":100,"trust":75,"tag_list":["30-min tech talk","chatbots","conversational interface","microsoft bot framework","cognitive api","machine learning","natural language understanding","javascript"],"profile":{"name":"Pavel Veller","bio":"Web Developer and Technologist. I have been building things for the web since the late 90s using Java, C#, Ruby, JavaScript and everything in between. Digital architect and a CTO by day and an avid learner by night. My interests of late include conversational interfaces, deep learning, and Elixir.","twitter":"pveller","company":"EPAM Systems","url":"http://www.pveller.com","shirt_size":"Men's M","email":"Pavel_Veller@epam.com","location":"Atlanta, GA"},"talk":{"title":"Building Smarter Apps with Cognitive APIs","description":"In this talk I will introduce `cognitive` APIs (e.g. image recognition, text analysis, recommendations, predictions), will explain what they are and how one can use them, and will do a live comparison of four image recognition endpoints. I will show the similarities in usage patterns and highlight the differences in API design.\r\n\r\nThe second half of my talk is a live demo of an e-commerce chatbot that uses a combination of natural language understanding and API orchestration to deliver commerce features over a conversational interface. I will then explain how the bot is built and where the *smarts* are coming from. I will talk about the ever increasing importance of the APIs and how no-screen interfaces like chatbots will stimulate the API economy.","notes":"I gave this talk at APIStrat in Boston (11/2 - 11/4/2016) and you can see the slides [here](http://www.slideshare.net/pveller/cognitive-apis-and-conversational-interfaces). I will be posting more details about the bot and how it's built on my blog as well. The bot will likely evolve over the next few months so my presentation at this event will be slightly different. I am also sure the capabilities of the bot framework(s) and conversational channels will only increase too If I only take the bot part, I can fit a 15 minutes / lightning talk slot. If I expand it a little like I did at API Strat and talk about cognitive/ML APIs first and then show and explain the bot, then it will be closer to 30 minutes. The audience at APIStrat seemed to have like the talk a lot as it went deeper than concepts and overviews. \r\n\r\nUPDATE: I just had another idea for a bot that I will build to accompany a simple travel tracking app that I've been working on. Hopefully will be able to add that one to the mix and talk about how bots add new channels to the existing apps/experienced.\r\n\r\nUPDATE 2: I have by now published [the code of the bot on github](https://github.com/pveller/ecommerce-chatbot) and also did a [screencast about it](https://www.youtube.com/watch?v=uDar3aLdM_M)","abstract":"Introduce cognitive APIs, highlight differences in implementation and capabilities, dive into the details of pre-trained APIs vs. trainable-models-as-a-service, and finally showcase using cognitive APIs to build a conversational e-Commerce product recommendation chat bot.\n\n","audience_level":"Intermediate","talk_format":"Tech Talks and Tech Tutorials (30 or 90 minutes - please specify the exact time in the Notes section)"}}
{"index":{"_index":"submissions","_type":"201701182236"}}
{"id":8202,"state":"submitted","confirmed":false,"created_at":"2017-01-17T04:42:37.066Z","updated_at":"2017-01-17T04:42:37.066Z","additional_info":"N/A","rating":0,"trust":0,"tag_list":[],"profile":{"name":"Siva Muthu","bio":"Siva Muthu is an Enterprise Architect focused on standardizing Deloitte Consulting’s development methodology, improve the quality of custom development practice, and enable the use of delivery models in a predictable way. Lead a team of architects who provides technical architectural services for all the Deloitte Consulting custom development engagements across the USA. Siva brings the Deloitte Consulting's national architecture team experience to this session. \r\n\r\n* Siva Muthu is a seasoned professional with 20+ years of experience in information technology and large-scale enterprise solutions. Projects involved cross-industry IT strategy, analysis, design, implementation of information systems in client/server environments as well as the implementation of custom-built web-based applications. \r\n\r\n* Leading Deloitte's.NET custom development framework team and proving advisory services for many engagements on project assessment, architecture review, and estimation methodology.\r\n\r\n* Specialized in solution architecture, project assessment Microsoft.net technology and related products, design patterns, framework development and development process engineering concepts. Experienced in managing and overseeing the installation and configuration of system infrastructure at the enterprise level including servers, virtualization, security features. Also experienced with designing, documenting, evaluating, and implementing software architectures that include SOA, enterprise, application, and system level architectures using object-oriented principles, design patterns, layering, patterns of enterprise applications, and architecture tradeoff analysis method. Also extensively practiced design methodologies (ICONIX, BOOCH, OMT), OO Modeling techniques & SLC methodologies (RUP & MSF).\r\n\r\n* Worked as a Software Development Manager for the last six (8) years on seven (7) projects including systems that support more than one (1) million end users. He has managed software development teams of up to 75 staff. Siva has developed and deployed multiple web-based systems that support more than 200,000 internet registered end-users.\r\n","twitter":"","company":"Deloitte Consulting ","url":"","shirt_size":"Men's M","email":"smuthu@deloitte.com","location":"#<OmniAuth::AuthHash country=#<OmniAuth::AuthHash code=\"us\"> name=\"Sacramento, California Area\">"},"talk":{"title":"Case studies of enterprise IT governance models for architecture and framework for architecture maturity assessment ","description":"Enterprise IT realized that architects play a critical role in evolving IT. Most large scale organizations have established the architecture teams to guide the organizations in constantly evolving IT. Architecture team structure and their governance maturity are critical to the success of an organization in navigating the IT challenges, bringing the innovation required to gain the edge in the marketplace and successfully delivering the IT projects for the organization. It is important for IT leaders and architects to understand the best practices in establishing the architecture teams in the organization, and how to assess the architecture team’s maturity. \r\nThis session will present the experience from conducting many architecture assessments by one of the biggest consulting firms. Session topic begins with the evolution of an architect’s roles in evolving IT and how did architect’s responsibilities and influence change over the last 4 decades. Then, session moves to the observations from real-world on how organizations structure the architecture team and discuss the pros-cons of different architecture team structures observed in various industries. Also, the presenter shares the assessment model used to assess the architecture team’s maturity in enterprise IT and case studies from real-world architecture assessments. \r\nAttendees learn the best practices in structuring the architecture teams within an organization and how to increase the effectiveness of the architecture teams. Also, learn the architecture assessment model used in many assessments across the industries and multiple case studies presenting how did the architecture team influence the success and failure of organizations.  \r\n","notes":"Siva Muthu is a seasoned architect with 20+ years of experience in information technology and large-scale enterprise solutions. He was one of the instrumental leaders created an Application Architecture practice for Deloitte Consulting and led many architecture assessments across the industries. He also developed the Deloitte Consulting’s standard custom development framework and provides architecture advisory services for many engagements on project assessment, architecture review, and estimation methodologies. Specialized in solution architecture, project assessment, Microsoft.net technologies, and related products, design patterns, framework development and development process engineering concepts.","abstract":"This presentation explores the various IT governance models used by organizations to govern the architecture decisions, the framework to assess the architecture maturity in an organization, and a case study of multiple large scale enterprises on their IT architecture maturity. ","audience_level":"All","talk_format":"Experience Report Presentation (30 minutes)"}}
{"index":{"_index":"submissions","_type":"201701182236"}}
{"id":7182,"state":"submitted","confirmed":false,"created_at":"2016-12-15T22:11:41.274Z","updated_at":"2016-12-15T22:11:41.274Z","additional_info":"https://www.youtube.com/watch?v=hLQAQlwY6-k&list=PLvk9Yh_MWYuwTYjxOqjzOlVmFFHvN3Yp7&index=2","rating":75,"trust":50,"tag_list":["30-min tech talk"],"profile":{"name":"Chris Fulton","bio":"Christopher Fulton is a Global Technical Account Manager at Electric Cloud. He is focused on leading the Professional Services efforts at large FinServe customers and has successfully implemented ElectricFlow at several of Electric Cloud’s largest customers. Chris holds a degree in Computer Science and Religion. Prior to Electric Cloud, he worked for 10 years as a Build and Release manager, where he took week long processes and automated them to hours.","twitter":"cfulton81","company":"Electric Cloud","url":"http://electric-cloud.com/blog/","shirt_size":"Men's L","email":"oheel@catapultpr-ir.com","location":"Los Angeles, CA"},"talk":{"title":"CD for DBs: Database Deployment Strategies","description":"As organizations invest in DevOps to release more frequently, there’s a need to treat the database tier as an integral part of your automated delivery pipeline – to build, test and deploy database changes just like any other part of your application.\r\n\r\nHowever, databases (particularly RDBMS) are different from source code, and pose unique challenges to Continuous Delivery - especially in the context of deployments. Often, code changes require updating or migrating the database before the application can be deployed. A deployment method that works for installing a small database or a green-field application may not be suitable for industrial-scale databases. Updating the database can be more demanding than updating the app layer: database changes are more difficult to test, and rollbacks are harder. Furthermore, for organizations who strive to minimize service interruption to end users, database updates with no-downtime are a laborious operation. \r\n\r\nYour DB stores the most mission-critical and sensitive data of your organization (transaction data, business data, user information, etc.). As you update your database, you’d want to ensure data integrity, ACID, data retention, and have a solid rollback strategy - in case things go wrong …\r\n\r\nThis talk covers strategies for database deployments and rollbacks:\r\n\r\n• What are some patterns and best practices for reliably deploying databases as part of your CD pipeline?\r\n• How do you safely rollback database code? \r\n• How do you ensure data integrity?\r\n• What are some best practices for handling advanced scenarios and back-end processes, such as scheduled tasks, ETL routines, replication architecture, linked databases across distributed infrastructure, and more.\r\n• How to handle legacy database, alongside more modern data management solutions? \r\n","notes":"","abstract":"Your DB stores the most mission-critical and sensitive data of your organization (transaction data, business data, user information, etc.). As you update your database, you’d want to ensure data integrity, ACID, data retention, and have a solid rollback strategy - in case things go wrong. ","audience_level":"Intermediate","talk_format":"Tech Talks and Tech Tutorials (30 or 90 minutes - please specify the exact time in the Notes section)"}}
